word_percent = {
    '0':'процентов',
    '1':'процент',
    '2':'процента',
    '3':'процента',
    '4':'процента',
    '5':'процентов',
    '6':'процентов',
    '7':'процентов',
    '8':'процентов',
    '9':'процентов',
    '10':'процентов',
    '11':'процентов',
    '12':'процентов',
    '13':'процентов',
    '14':'процентов',
    '15':'процентов',
    '16':'процентов',
    '17':'процентов',
    '18':'процентов',
    '19':'процентов',
    '20':'процентов'
}

num_percent = input('Введите значение от 0 до 20: ')
print('{0} {1}'.format(num_percent, word_percent[num_percent]))
print('Проверка склонений: \n {}'.format(word_percent))